|Variable|Definition|Key|
|---|---|---|
|survival|Survival|0 = No, 1 = Yes|
|pclass|Ticket class|1 = 1st, 2 = 2nd, 3 = 3rd|
|gender|gender ||
|Age |Age in years| |
|sibsp |number of siblings / spouses aboard|	|
|parch |number of parents / children aboard| |
|ticket|Ticket number ||
|fare | fare| 	|
|cabin |Cabin number|	|
|embarked|Port of Embarkation|C = Cherbourg, Q = Queenstown, S = Southampton|
|boat | Lifeboat||
|body | Body Identification Number||
|home.dest| Home/destination||

- Read data and describe it
- Find columns with missingdata
- Print shape of dataset
- drop columns with more than 25% missing data
- drop columns having independent values(which do not affect the survival rate).


- check data types of all columns
- convert fare to numeric
- find columns still having missing/na values and also count of missing data
- fill na with mean for fare and age column column.
- drop rows where na values are present in embarked column.
- dump the dataframe to a csv file 'titanic_filtered.csv'.


- for surviced column replace 0 with D and 1 with A
- find the frequency of different values in survived column
- group by gender and survived and see the counts in each category
- find different pclass and no of people in each class

- find top 5 people with highest values of age. Count no of male and females in the top 5
- find max age male and female who survived
- get average age by gender
- get average age by people survived vs not-survived

In [1]:
import pandas as pd

In [53]:
df = pd.read_csv("titanic_dataset.csv", index_col=0)

In [54]:
print(df.head())

   pclass  survived                                             name  gender  \
0       1         1                    Allen, Miss. Elisabeth Walton  female
1       1         1                   Allison, Master. Hudson Trevor    male
2       1         0                     Allison, Miss. Helen Loraine  female
3       1         0             Allison, Mr. Hudson Joshua Creighton    male
4       1         0  Allison, Mrs. Hudson J C (Bessie Waldo Daniels)  female

       age  sibsp  parch  ticket      fare    cabin embarked boat   body  \
0  29.0000      0      0   24160  $211.34        B5        S    2    NaN
1   0.9167      1      2  113781  $151.55   C22 C26        S   11    NaN
2   2.0000      1      2  113781  $151.55   C22 C26        S  NaN    NaN
3  30.0000      1      2  113781  $151.55   C22 C26        S  NaN  135.0
4  25.0000      1      2  113781  $151.55   C22 C26        S  NaN    NaN

                         home.dest
0                     St Louis, MO
1  Montreal, PQ / Chesterville, ON
2  Montreal, PQ / Chesterville, ON
3  Montreal, PQ / Chesterville, ON
4  Montreal, PQ / Chesterville, ON

In [30]:
print(df.query("survived == 1 & sibsp > 0").shape)
df[(df.survived ==  1) & (df.sibsp > 0)].shape

(500, 14)

(0, 14)

In [12]:
df.query("(survived == 1) and (sibsp > 0)").shape

(191, 14)

In [37]:
df.isna().any()

pclass       False
survived     False
name         False
gender       False
age           True
sibsp        False
parch        False
ticket       False
fare          True
cabin         True
embarked      True
boat          True
body          True
home.dest     True
dtype: bool

In [38]:
df.columns[df.isna().sum() >0]

Index(['age', 'fare', 'cabin', 'embarked', 'boat', 'body', 'home.dest'], dtype='object')

In [39]:
df.shape

(1309, 14)

In [ ]:
#Find columns for which more than 50% data is missing and drop them (Column Deletion)
df = pd.read_excel ('Australia.xlsx',skiprows=20)
# #df = df.loc[:, df.isin(['..','NaN']).mean() < .1]
# #df.isin([' ','NaN', 0]).mean()

# # df[df.columns[df.mean(axis=1)>.5]]
# #df.drop(columns=df.columns[((df==0).mean()>0.0005)],axis=1)
# df.loc[:, df.isnull().mean() <= .5]

In [ ]:
titanic.loc[:, titanic.isna().sum()/(len(titanic))*100 >= 25.0]

In [ ]:
titanic = titanic.loc[:, titanic.isin([' ',np.nan]).mean()<.25]

In [ ]:
# thresh : int, optional
#    Require that many non-NA values.

# keep columns/rows where atleast thesh no of entires are there
df.dropna(axis=1, thresh=0.75*df.shape[0], inplace=True )

In [56]:
df.dropna(thresh=df.shape[0]*0.75,how= 'any',axis= 1,inplace = True)
print(df.shape)

(1309, 10)

In [57]:
print(df.head())

   pclass  survived                                             name  gender  \
0       1         1                    Allen, Miss. Elisabeth Walton  female
1       1         1                   Allison, Master. Hudson Trevor    male
2       1         0                     Allison, Miss. Helen Loraine  female
3       1         0             Allison, Mr. Hudson Joshua Creighton    male
4       1         0  Allison, Mrs. Hudson J C (Bessie Waldo Daniels)  female

       age  sibsp  parch  ticket      fare embarked
0  29.0000      0      0   24160  $211.34         S
1   0.9167      1      2  113781  $151.55         S
2   2.0000      1      2  113781  $151.55         S
3  30.0000      1      2  113781  $151.55         S
4  25.0000      1      2  113781  $151.55         S

In [41]:
import numpy as np

In [47]:
df1 = pd.DataFrame({"A":[1,2,3,4, np.nan, np.nan], "B":[1,2,3,4, np.nan, 6]})
print(df1)

     A    B
0  1.0  1.0
1  2.0  2.0
2  3.0  3.0
3  4.0  4.0
4  NaN  NaN
5  NaN  6.0

In [48]:
# each col should have atleast 4 non-values
df1.dropna(axis=1, thresh=4)

     A    B
0  1.0  1.0
1  2.0  2.0
2  3.0  3.0
3  4.0  4.0
4  NaN  NaN
5  NaN  6.0

In [49]:
# each col should have atleast 5 non-values
df1.dropna(axis=1, thresh=5)

     B
0  1.0
1  2.0
2  3.0
3  4.0
4  NaN
5  6.0

In [50]:
# each col should have atleast 2 non-values
df1.dropna(axis=1, thresh=2)

     A    B
0  1.0  1.0
1  2.0  2.0
2  3.0  3.0
3  4.0  4.0
4  NaN  NaN
5  NaN  6.0

In [58]:
df.dtypes

pclass        int64
survived      int64
name         object
gender       object
age         float64
sibsp         int64
parch         int64
ticket       object
fare         object
embarked     object
dtype: object

In [ ]:
df.fare.str.replace("$","")
df.fare.replace(.. use a regex)b
df.fare.applymap(...)

In [69]:
# each value in fare column starts with a '$'
df["fare"] = df["fare"].apply(lambda x : x[1:] if pd.notnull(x) else np.nan)
print(df.fare)

0       1.34
1       1.55
2       1.55
3       1.55
4       1.55
        ...
1304     .45
1305     .45
1306      23
1307      23
1308      88
Name: fare, Length: 1309, dtype: object

In [71]:
df.fare =  df.fare.astype("float64")

In [ ]:
pd.to_numeric(df['fare'],errors='coerce')
pd.to_numeric(s, errors='coerce').fillna(0, downcast='infer')

In [61]:
df.isna().sum()

pclass        0
survived      0
name          0
gender        0
age         263
sibsp         0
parch         0
ticket        0
fare          1
embarked      2
dtype: int64

In [65]:
1309 - df.count()

pclass        0
survived      0
name          0
gender        0
age         263
sibsp         0
parch         0
ticket        0
fare          1
embarked      2
dtype: int64

In [67]:
df.age.mean()

29.8811345124283

In [ ]:
df.fillna()

In [72]:
df.fillna({"age":df.age.mean(), "fare":df.fare.mean()}, inplace=True)

In [ ]:
titanic[['age', 'fare']] = titanic[['age', 'fare']].fillna(titanic.mean())

In [75]:
df.mean()

pclass       2.294882
survived     0.381971
age         29.881135
sibsp        0.498854
parch        0.385027
fare        20.364518
dtype: float64

In [76]:
df[['age', 'fare']]

            age   fare
0     29.000000   1.34
1      0.916700   1.55
2      2.000000   1.55
3     30.000000   1.55
4     25.000000   1.55
...         ...    ...
1304  14.500000   0.45
1305  29.881135   0.45
1306  26.500000  23.00
1307  27.000000  23.00
1308  29.000000  88.00

[1309 rows x 2 columns]

In [73]:
df.isna().sum()

pclass      0
survived    0
name        0
gender      0
age         0
sibsp       0
parch       0
ticket      0
fare        0
embarked    2
dtype: int64

In [ ]:
df.dropna()

In [ ]:
titanic.drop(labels=titanic[titanic.embarked.isna()].index, inplace=True)

In [80]:
df.dropna(subset=['embarked'], inplace=True)

In [ ]:
df1['survived'].replace({1:'A',0: 'D'}, inplace = True )

In [81]:
df.survived.value_counts()

0    809
1    498
Name: survived, dtype: int64

In [84]:
df.count()

pclass      1307
survived    1307
name        1307
gender      1307
age         1307
sibsp       1307
parch       1307
ticket      1307
fare        1307
embarked    1307
dtype: int64

In [83]:
df.groupby(['gender', 'survived']).count()

                 pclass  name  age  sibsp  parch  ticket  fare  embarked
gender survived
female 0            127   127  127    127    127     127   127       127
       1            337   337  337    337    337     337   337       337
male   0            682   682  682    682    682     682   682       682
       1            161   161  161    161    161     161   161       161

In [85]:
df.groupby(['gender', 'survived']).size()

gender  survived
female  0           127
        1           337
male    0           682
        1           161
dtype: int64

In [86]:
df['pclass'].value_counts()

3    709
1    321
2    277
Name: pclass, dtype: int64

In [87]:
# find top 5 people with highest values of age. Count no of male and females in the top 5
df.sort_values(by="age", ascending=False).head()["gender"].value_counts()

male      4
female    1
Name: gender, dtype: int64

In [93]:
s = pd.Series([1,2,1,1,2,np.nan])
print(s.count())
print(s.shape)

print()
print(s.value_counts())
print(s.unique())

5
(6,)

1.0    3
2.0    2
dtype: int64
[ 1.  2. nan]

In [95]:
# find max age male and female who survived
df[df["survived"] == 1].groupby(by="gender").max()["age"]

gender
female    76.0
male      80.0
Name: age, dtype: float64

In [ ]:

r = df1.loc[df1['survived'] == 'A']
grp = r.groupby('gender')
grp.age.max()

In [98]:
# get average age by gender
df.groupby(by="gender").age.mean()

gender
female    28.795931
male      30.430716
Name: age, dtype: float64

In [99]:
# get average age by people survived vs not-survived
df.groupby(by=["survived"]).age.mean()

survived
0    30.389368
1    28.974711
Name: age, dtype: float64

In [108]:
df.groupby('gender', as_index=False).age.mean()

"""
  gender age
0  M      10
1  M      10
2  M      10
3  M      10
4  F      20
5  F      20
6  F      20

group by as_index=True
gender    
         age
M      10
       10

F       20
        20

    
group by as_index=True
index    
        gender   age
0        M       10
         M       10

1        F        20
         F        20
"""

print()

In [ ]:
df.groupby('gender').age.mean()